#+TITLE: Modeling with Mutable Data
** Filter
#+name:filter
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (filter predicate sequence)
    (cond ((null? sequence) nil)
          ((predicate (car sequence)) (cons (car sequence) (filter predicate (cdr sequence))))
          (else (filter predicate (cdr sequence)))))
#+end_src

#+RESULTS:
: (1 3 5)

** Semaphore ( Exercise 3.47 a)
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (make-semaphore n)
    (let ((capacity 0) (lock (make-mutex)))
      (define (semaphore m)
        (cond ((eq? m 'acquire) ((if (>= capacity (- n 1)) (lock 'acquire))
                                 (set! capacity (inc capacity))))
              ((eq? m 'release) ((if (= capacity n) (lock 'release))
                                 (set! capacity (dec capacity))))))))
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-ibTvzi/org-babel-uCWiF1.rkt:4:0: without-interrupts: unbound identifier
:   in: without-interrupts
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-ibTvzi/org-babel-uCWiF1.rkt:4:0

** Semaphore ( Exercise 3.47 b)
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (make-semaphore n)
    (let ((capacity 0) (cell (list false)))
      (define (semaphore m)
        (cond ((eq? m 'acquire) ((if (= capacity n)
                                     (if (test-and-set! cell)
                                         (semaphore 'acquire))
                                     (set! capacity (inc capacity)))))
              ((eq? m 'release) ((if (= capacity n)
                                     (clear! cell))
                                 (set! capacity (dec capacity))))))))
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-ibTvzi/org-babel-uCWiF1.rkt:4:0: without-interrupts: unbound identifier
:   in: without-interrupts
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-ibTvzi/org-babel-uCWiF1.rkt:4:0


